# ElementRenamedOnImport Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..ElementRenamedOnImport Property
BuiltInFailures..::..ImportFailures Class See Also
---
There were duplicate names between the active model and the imported element. To avoid duplicate names, the imported element has been renamed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementRenamedOnImport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementRenamedOnImport As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementRenamedOnImport {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace